In [1]:
import pandas as pd
import numpy as np

In [5]:
s1 = pd.Series([1,2,3,4])
s2 = pd.Series([11,12,13,14])
df = pd.DataFrame([s1,s2])
df  ## DF execute in a table form and their is a index and columns.

    0   1   2   3
0   1   2   3   4
1  11  12  13  14

In [6]:
df.index = ['r1','r2']
df.columns = ['s1','s2','s3','s4']
df

    s1  s2  s3  s4
r1   1   2   3   4
r2  11  12  13  14

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
type(df['s2'])

pandas.core.series.Series

In [9]:
df.shape

(2, 4)

In [10]:
df.size

8

## Different ways to create DataFrame

In [11]:
df1 = pd.DataFrame(np.arange(1,26).reshape(5,5))
df1

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [2]:
#rowwise
employee = pd.DataFrame([[101,'Raj',35000],
                         [102,'shree',40000],
                         [103,'raji',45000]])
employee

     0      1      2
0  101    Raj  35000
1  102  shree  40000
2  103   raji  45000

In [16]:
employee = pd.DataFrame([[101,'Rajshree',35000],
                         [102,'Shrikant',40000],
                         [103,'Ashwini',45000]],
                       columns = ['eid','name','salary'], ## For changing columns name.
                       index = ['x1','x2','x3']) ## For changing index name.
employee

    eid      name  salary
x1  101  Rajshree   35000
x2  102  Shrikant   40000
x3  103   Ashwini   45000

In [5]:
# Columnswise
students = pd.DataFrame({'rollno':[1,2,3,4],
                         'name':['ram','shyam','geeta','seeta'],
                         'marks':[67,78,98,79]})
students

   rollno   name  marks
0       1    ram     67
1       2  shyam     78
2       3  geeta     98
3       4  seeta     79

In [7]:
students.columns 
## For a column search

Index(['rollno', 'name', 'marks'], dtype='object')

In [8]:
intake = pd.DataFrame({'seats': [60,120,120],
                       'Admitted': [55,112,117]},
                      index = ['mech','IT','CS'])

In [9]:
intake

      seats  Admitted
mech     60        55
IT      120       112
CS      120       117

## Adding /removing row or column

In [18]:
intake['available']= intake['seats'] - intake['Admitted']
intake

      seats  Admitted  available
mech     60        55          5
IT      120       112          8
CS      120       117          3

In [17]:
employee

    eid      name  salary
x1  101  Rajshree   35000
x2  102  Shrikant   40000
x3  103   Ashwini   45000

In [18]:
employee['gender'] = ['f','m','f']
employee

    eid      name  salary gender
x1  101  Rajshree   35000      f
x2  102  Shrikant   40000      m
x3  103   Ashwini   45000      f

In [19]:
employee.loc[3]= [104,'Shweta',43000,'f']
employee

    eid      name  salary gender
x1  101  Rajshree   35000      f
x2  102  Shrikant   40000      m
x3  103   Ashwini   45000      f
3   104    Shweta   43000      f

## 3rd Feb 2025

In [22]:
employee.loc[employee.shape[0]]= [103,'Nishant',34000,'m']
employee

    eid      name  salary gender
x1  101  Rajshree   35000      f
x2  102  Shrikant   40000      m
x3  103   Ashwini   45000      f
3   104    Shweta   43000      f
4   103    Sakshi   34000      f
5   103   Nishant   34000      f
6   103   Nishant   34000      m

In [23]:
employee.loc[employee.shape[0]]= [105, 'Neha', 30000, 'f']
employee

    eid      name  salary gender
x1  101  Rajshree   35000      f
x2  102  Shrikant   40000      m
x3  103   Ashwini   45000      f
3   104    Shweta   43000      f
4   103    Sakshi   34000      f
5   103   Nishant   34000      f
6   103   Nishant   34000      m
7   105      Neha   30000      f

In [24]:
employee['address']= ['pune','gujrat','tekdi','pune','arvi', 'arvi', 'karanja','pune']

In [25]:
employee

    eid      name  salary gender  address
x1  101  Rajshree   35000      f     pune
x2  102  Shrikant   40000      m   gujrat
x3  103   Ashwini   45000      f    tekdi
3   104    Shweta   43000      f     pune
4   103    Sakshi   34000      f     arvi
5   103   Nishant   34000      f     arvi
6   103   Nishant   34000      m  karanja
7   105      Neha   30000      f     pune

In [26]:
employee['dno'] = [1,2,1,np.nan,3,3,1,2] ## NaN give by default float values
employee

    eid      name  salary gender  address  dno
x1  101  Rajshree   35000      f     pune  1.0
x2  102  Shrikant   40000      m   gujrat  2.0
x3  103   Ashwini   45000      f    tekdi  1.0
3   104    Shweta   43000      f     pune  NaN
4   103    Sakshi   34000      f     arvi  3.0
5   103   Nishant   34000      f     arvi  3.0
6   103   Nishant   34000      m  karanja  1.0
7   105      Neha   30000      f     pune  2.0

In [27]:
employee['annual salary'] = employee['salary'] * 12

In [28]:
employee

    eid      name  salary gender  address  dno  annual salary
x1  101  Rajshree   35000      f     pune  1.0         420000
x2  102  Shrikant   40000      m   gujrat  2.0         480000
x3  103   Ashwini   45000      f    tekdi  1.0         540000
3   104    Shweta   43000      f     pune  NaN         516000
4   103    Sakshi   34000      f     arvi  3.0         408000
5   103   Nishant   34000      f     arvi  3.0         408000
6   103   Nishant   34000      m  karanja  1.0         408000
7   105      Neha   30000      f     pune  2.0         360000

In [29]:
emp1 = employee.drop('annual salary',axis=1) ## It will return the value but not change in original table 
#so we have to put in new variable{emp1} is a new variable

In [30]:
emp1

    eid      name  salary gender  address  dno
x1  101  Rajshree   35000      f     pune  1.0
x2  102  Shrikant   40000      m   gujrat  2.0
x3  103   Ashwini   45000      f    tekdi  1.0
3   104    Shweta   43000      f     pune  NaN
4   103    Sakshi   34000      f     arvi  3.0
5   103   Nishant   34000      f     arvi  3.0
6   103   Nishant   34000      m  karanja  1.0
7   105      Neha   30000      f     pune  2.0

In [31]:
employee.drop('annual salary',axis = 1,inplace= True) ### Inplace change the original dataframe format true means change all dataframe 
#or we have to write false to not change the dataframe

In [32]:
employee

    eid      name  salary gender  address  dno
x1  101  Rajshree   35000      f     pune  1.0
x2  102  Shrikant   40000      m   gujrat  2.0
x3  103   Ashwini   45000      f    tekdi  1.0
3   104    Shweta   43000      f     pune  NaN
4   103    Sakshi   34000      f     arvi  3.0
5   103   Nishant   34000      f     arvi  3.0
6   103   Nishant   34000      m  karanja  1.0
7   105      Neha   30000      f     pune  2.0

In [36]:
# employee.drop(5,inplace=True) 
## To drop a row >>> drop method return value if we want to store the data in dataframe then use 
# inplace method

In [37]:
employee

    eid      name  salary gender  address  dno
x1  101  Rajshree   35000      f     pune  1.0
x2  102  Shrikant   40000      m   gujrat  2.0
x3  103   Ashwini   45000      f    tekdi  1.0
3   104    Shweta   43000      f     pune  NaN
4   103    Sakshi   34000      f     arvi  3.0
6   103   Nishant   34000      m  karanja  1.0
7   105      Neha   30000      f     pune  2.0

## Selection

In [37]:
df1.columns=['A','B','C','D','E']
df1.index = ['i1','i2','i3','i4','i5']

In [38]:
df1

     A   B   C   D   E
i1   1   2   3   4   5
i2   6   7   8   9  10
i3  11  12  13  14  15
i4  16  17  18  19  20
i5  21  22  23  24  25

In [39]:
df1['C']

i1     3
i2     8
i3    13
i4    18
i5    23
Name: C, dtype: int64

In [40]:
df1[['B','C']]

     B   C
i1   2   3
i2   7   8
i3  12  13
i4  17  18
i5  22  23

In [41]:
df1

     A   B   C   D   E
i1   1   2   3   4   5
i2   6   7   8   9  10
i3  11  12  13  14  15
i4  16  17  18  19  20
i5  21  22  23  24  25

In [42]:
df1.loc['i1']

A    1
B    2
C    3
D    4
E    5
Name: i1, dtype: int64

In [43]:
df1[['A','B','C']]

     A   B   C
i1   1   2   3
i2   6   7   8
i3  11  12  13
i4  16  17  18
i5  21  22  23

In [44]:
df1.loc[['i1','i4']]

     A   B   C   D   E
i1   1   2   3   4   5
i4  16  17  18  19  20

In [45]:
df1

     A   B   C   D   E
i1   1   2   3   4   5
i2   6   7   8   9  10
i3  11  12  13  14  15
i4  16  17  18  19  20
i5  21  22  23  24  25

In [46]:
df1.loc[['i2','i3','i4'],['A','B']]

     A   B
i2   6   7
i3  11  12
i4  16  17

In [47]:
df1.loc[['i1','i3','i4'],['D','E']]

     D   E
i1   4   5
i3  14  15
i4  19  20

In [49]:
employee.reset_index(inplace=True) 
## It is use for the reset the indexing ans start from again 0

In [50]:
employee

   index  eid      name  salary gender  address  dno
0      0  101  Rajshree   35000      f     pune  1.0
1      1  102  Shrikant   40000      m   gujrat  2.0
2      2  103   Ashwini   45000      f    tekdi  1.0
3      3  104    Shweta   43000      f     pune  NaN
4      4  103    Sakshi   34000      f     arvi  3.0
5      5  103   Nishant   34000      m  karanja  1.0
6      6  105      Neha   30000      f     pune  2.0

In [51]:
employee.drop('index',axis=1, inplace=True) # It will drop index column using the axis[1] means 
# column and save in original dataframe.

In [52]:
employee

   eid      name  salary gender  address  dno
0  101  Rajshree   35000      f     pune  1.0
1  102  Shrikant   40000      m   gujrat  2.0
2  103   Ashwini   45000      f    tekdi  1.0
3  104    Shweta   43000      f     pune  NaN
4  103    Sakshi   34000      f     arvi  3.0
5  103   Nishant   34000      m  karanja  1.0
6  105      Neha   30000      f     pune  2.0

In [53]:
employee.iloc[1] ## This [iloc] use for a default indexing and the employee is default table

eid             102
name       Shrikant
salary        40000
gender            m
address      gujrat
dno             2.0
Name: 1, dtype: object

In [54]:
employee[employee['name'] =='Rajshree']

   eid      name  salary gender address  dno
0  101  Rajshree   35000      f    pune  1.0

In [55]:
employee[employee['salary'] >  30000] #3 This one sort the salary that can greater than 30000 using conditional selection

   eid      name  salary gender  address  dno
0  101  Rajshree   35000      f     pune  1.0
1  102  Shrikant   40000      m   gujrat  2.0
2  103   Ashwini   45000      f    tekdi  1.0
3  104    Shweta   43000      f     pune  NaN
4  103    Sakshi   34000      f     arvi  3.0
5  103   Nishant   34000      m  karanja  1.0

In [56]:
employee

   eid      name  salary gender  address  dno
0  101  Rajshree   35000      f     pune  1.0
1  102  Shrikant   40000      m   gujrat  2.0
2  103   Ashwini   45000      f    tekdi  1.0
3  104    Shweta   43000      f     pune  NaN
4  103    Sakshi   34000      f     arvi  3.0
5  103   Nishant   34000      m  karanja  1.0
6  105      Neha   30000      f     pune  2.0

In [57]:
employee[employee['address']=='pune']

   eid      name  salary gender address  dno
0  101  Rajshree   35000      f    pune  1.0
3  104    Shweta   43000      f    pune  NaN
6  105      Neha   30000      f    pune  2.0

In [58]:
employee[(employee['salary']> 30000) & (employee['gender']=='f')] ## If we use & and condtional selection that are two or more 
#then we have to write in a parathesis().

   eid      name  salary gender address  dno
0  101  Rajshree   35000      f    pune  1.0
2  103   Ashwini   45000      f   tekdi  1.0
3  104    Shweta   43000      f    pune  NaN
4  103    Sakshi   34000      f    arvi  3.0

## 4 Feb 2025

In [59]:
employee

   eid      name  salary gender  address  dno
0  101  Rajshree   35000      f     pune  1.0
1  102  Shrikant   40000      m   gujrat  2.0
2  103   Ashwini   45000      f    tekdi  1.0
3  104    Shweta   43000      f     pune  NaN
4  103    Sakshi   34000      f     arvi  3.0
5  103   Nishant   34000      m  karanja  1.0
6  105      Neha   30000      f     pune  2.0

In [60]:
employee.loc[7]=[105, 'Sakshi',38000, 'f','baramati', 1] 
## To add a new dataframe then we use [loc]

In [61]:
# employee.loc[6]= [105,'Neha',30000,'f','pune',2]

In [62]:
employee

   eid      name  salary gender   address  dno
0  101  Rajshree   35000      f      pune  1.0
1  102  Shrikant   40000      m    gujrat  2.0
2  103   Ashwini   45000      f     tekdi  1.0
3  104    Shweta   43000      f      pune  NaN
4  103    Sakshi   34000      f      arvi  3.0
5  103   Nishant   34000      m   karanja  1.0
6  105      Neha   30000      f      pune  2.0
7  105    Sakshi   38000      f  baramati  1.0

In [63]:
#find a name and gender of a employee that having salary < 40000
employee[employee['salary']<40000] [['name','gender']]
## For two condition use [[--]] bracket

       name gender
0  Rajshree      f
4    Sakshi      f
5   Nishant      m
6      Neha      f
7    Sakshi      f

In [64]:
employee

   eid      name  salary gender   address  dno
0  101  Rajshree   35000      f      pune  1.0
1  102  Shrikant   40000      m    gujrat  2.0
2  103   Ashwini   45000      f     tekdi  1.0
3  104    Shweta   43000      f      pune  NaN
4  103    Sakshi   34000      f      arvi  3.0
5  103   Nishant   34000      m   karanja  1.0
6  105      Neha   30000      f      pune  2.0
7  105    Sakshi   38000      f  baramati  1.0

In [65]:
# Nishant eid 
employee[employee['name'] == 'Nishant']['eid'] # One condition use [-] one bracket.

5    103
Name: eid, dtype: int64

In [66]:
employee.loc[employee['name'] == 'Neha', 'eid']=106 
## To change the row eid

In [74]:
employee.loc[employee['address'] == 'baramati', 'eid']=105

In [75]:
employee

   eid      name  salary gender   address  dno
0  101  Rajshree   35000      f      pune  1.0
1  102  Shrikant   40000      m    gujrat  2.0
2  103   Ashwini   45000      f     tekdi  1.0
3  104    Shweta   43000      f      pune  NaN
4  108    Sakshi   34000      f      arvi  3.0
5  107   Nishant   34000      m   karanja  1.0
6  106      Neha   30000      f      pune  2.0
7  105    Sakshi   38000      f  baramati  1.0

In [68]:
employee.loc[employee['name'] == 'Nishant', 'eid']=107

In [76]:
employee.loc[5,'salary']=43000 
## To change the salary use this one

In [77]:
employee.loc[3,'salary']=25000

In [78]:
employee

   eid      name  salary gender   address  dno
0  101  Rajshree   35000      f      pune  1.0
1  102  Shrikant   40000      m    gujrat  2.0
2  103   Ashwini   45000      f     tekdi  1.0
3  104    Shweta   25000      f      pune  NaN
4  108    Sakshi   34000      f      arvi  3.0
5  107   Nishant   43000      m   karanja  1.0
6  106      Neha   30000      f      pune  2.0
7  105    Sakshi   38000      f  baramati  1.0

In [79]:
dept = pd.DataFrame({'dno':[1,2,3,4,5],
                     'name':['IT','admin','HR','manager','SCM']})
# To create a new DataFrame

In [80]:
dept

   dno     name
0    1       IT
1    2    admin
2    3       HR
3    4  manager
4    5      SCM

In [81]:
employee

   eid      name  salary gender   address  dno
0  101  Rajshree   35000      f      pune  1.0
1  102  Shrikant   40000      m    gujrat  2.0
2  103   Ashwini   45000      f     tekdi  1.0
3  104    Shweta   25000      f      pune  NaN
4  108    Sakshi   34000      f      arvi  3.0
5  107   Nishant   43000      m   karanja  1.0
6  106      Neha   30000      f      pune  2.0
7  105    Sakshi   38000      f  baramati  1.0

In [83]:
pd.concat([employee,dept],axis=1)
#It will concat(combine) the two dataframe but not serially. and give the NaN value if the data is empty

   eid      name  salary gender   address  dno  dno     name
0  101  Rajshree   35000      f      pune  1.0  1.0       IT
1  102  Shrikant   40000      m    gujrat  2.0  2.0    admin
2  103   Ashwini   45000      f     tekdi  1.0  3.0       HR
3  104    Shweta   25000      f      pune  NaN  4.0  manager
4  108    Sakshi   34000      f      arvi  3.0  5.0      SCM
5  107   Nishant   43000      m   karanja  1.0  NaN      NaN
6  106      Neha   30000      f      pune  2.0  NaN      NaN
7  105    Sakshi   38000      f  baramati  1.0  NaN      NaN

In [84]:
pd.merge(employee,dept,on='dno')
# It will merge the two dataframe seriallt and remove the NaN dataframe. and remove the NaN values.

   eid    name_x  salary gender   address  dno name_y
0  101  Rajshree   35000      f      pune  1.0     IT
1  102  Shrikant   40000      m    gujrat  2.0  admin
2  103   Ashwini   45000      f     tekdi  1.0     IT
3  108    Sakshi   34000      f      arvi  3.0     HR
4  107   Nishant   43000      m   karanja  1.0     IT
5  106      Neha   30000      f      pune  2.0  admin
6  105    Sakshi   38000      f  baramati  1.0     IT

In [85]:
result = pd.merge(employee,dept,on='dno',how ='left')
result
# It will merge dataframe with NaN values

   eid    name_x  salary gender   address  dno name_y
0  101  Rajshree   35000      f      pune  1.0     IT
1  102  Shrikant   40000      m    gujrat  2.0  admin
2  103   Ashwini   45000      f     tekdi  1.0     IT
3  104    Shweta   25000      f      pune  NaN    NaN
4  108    Sakshi   34000      f      arvi  3.0     HR
5  107   Nishant   43000      m   karanja  1.0     IT
6  106      Neha   30000      f      pune  2.0  admin
7  105    Sakshi   38000      f  baramati  1.0     IT

## 5th Feb 2026

In [86]:
employee

   eid      name  salary gender   address  dno
0  101  Rajshree   35000      f      pune  1.0
1  102  Shrikant   40000      m    gujrat  2.0
2  103   Ashwini   45000      f     tekdi  1.0
3  104    Shweta   25000      f      pune  NaN
4  108    Sakshi   34000      f      arvi  3.0
5  107   Nishant   43000      m   karanja  1.0
6  106      Neha   30000      f      pune  2.0
7  105    Sakshi   38000      f  baramati  1.0

In [87]:
# employee['salary'].min()
# employee['salary'].max()
# employee['salary'].mean()
# employee['salary'].sum()
employee['salary'].count() # Count give the number of values present in a dataframe/table.

np.int64(8)

In [88]:
employee['dno'].mode() # It will give the number that occurences multiple number of time.

0    1.0
Name: dno, dtype: float64

In [97]:
employee.loc[employee['eid']==105,'name']='Nandini' ## To change the name in rowwise then use this one

In [98]:
employee

   eid      name  salary gender   address  dno
0  101  Rajshree   35000      f      pune  1.0
1  102  Shrikant   40000      m    gujrat  2.0
2  103   Ashwini   45000      f     tekdi  1.0
3  104    Shweta   25000      f      pune  NaN
4  108    Sakshi   34000      f      arvi  3.0
5  107   Nishant   43000      m   karanja  1.0
6  106      Neha   30000      f      pune  2.0
7  105   Nandini   38000      f  baramati  1.0

In [117]:
employee['name'].mode() #-> It will give the output in ascending order.
# It will give the all employee name because they are not a multiple time occur 
# mode work like if a data occurences multiple time that time mode give the result or if they present only one time then give all records

0     Ashwini
1     Nandini
2        Neha
3     Nishant
4    Rajshree
5      Sakshi
6    Shrikant
7      Shweta
Name: name, dtype: object

In [101]:
employee

   eid      name  salary gender   address  dno
0  101  Rajshree   35000      f      pune  1.0
1  102  Shrikant   40000      m    gujrat  2.0
2  103   Ashwini   45000      f     tekdi  1.0
3  104    Shweta   25000      f      pune  NaN
4  108    Sakshi   34000      f      arvi  3.0
5  107   Nishant   43000      m   karanja  1.0
6  106      Neha   30000      f      pune  2.0
7  105   Nandini   38000      f  baramati  1.0

In [103]:
employee.groupby('dno')['dno'].count()
#->> It work like a count all records according to grouping and give result.
## groupby ->> Group DataFrame using a mapper or by a Series of columns.
## Count non-NA cells for each column or row.

dno
1.0    4
2.0    2
3.0    1
Name: dno, dtype: int64

In [116]:
employee.groupby('dno')['salary'].sum() 
## It will give the dno wise salary in sum format using groupby.
## groupby ignore NaN values.

dno
1.0    161000
2.0     70000
3.0     34000
Name: salary, dtype: int64

In [107]:
employee.groupby('address')['address'].count() 
## Count the address how many time occur using groupby

address
arvi        1
baramati    1
gujrat      1
karanja     1
pune        3
tekdi       1
Name: address, dtype: int64

In [109]:
employee.groupby('gender')['salary'].max() 
## It will give the record of m,f employee that have max salary.

gender
f    45000
m    43000
Name: salary, dtype: int64

In [110]:
employee

   eid      name  salary gender   address  dno
0  101  Rajshree   35000      f      pune  1.0
1  102  Shrikant   40000      m    gujrat  2.0
2  103   Ashwini   45000      f     tekdi  1.0
3  104    Shweta   25000      f      pune  NaN
4  108    Sakshi   34000      f      arvi  3.0
5  107   Nishant   43000      m   karanja  1.0
6  106      Neha   30000      f      pune  2.0
7  105   Nandini   38000      f  baramati  1.0

In [112]:
employee['address'].unique() ## It will give the record that are unique and in array format.

array(['pune', 'gujrat', 'tekdi', 'arvi', 'karanja', 'baramati'],
      dtype=object)

In [114]:
employee['address'].values ## It will give all record not a unique in array format.

array(['pune', 'gujrat', 'tekdi', 'pune', 'arvi', 'karanja', 'pune',
       'baramati'], dtype=object)

In [118]:
## Dataframe Attributes
# -> shape - in tuple
# -> columns - in array format
# -> index - in array 
# -> values - 2D array

In [119]:
employee

   eid      name  salary gender   address  dno
0  101  Rajshree   35000      f      pune  1.0
1  102  Shrikant   40000      m    gujrat  2.0
2  103   Ashwini   45000      f     tekdi  1.0
3  104    Shweta   25000      f      pune  NaN
4  108    Sakshi   34000      f      arvi  3.0
5  107   Nishant   43000      m   karanja  1.0
6  106      Neha   30000      f      pune  2.0
7  105   Nandini   38000      f  baramati  1.0

In [122]:
employee['address'].value_counts() # If we want to count without using griuoby then use this one

address
pune        3
gujrat      1
tekdi       1
arvi        1
karanja     1
baramati    1
Name: count, dtype: int64

In [123]:
employee['gender'].value_counts()

gender
f    6
m    2
Name: count, dtype: int64

In [124]:
employee['BG'] = ['A+','B+','AB+',np.nan,'O+',np.nan,'B-','AB-']

In [126]:
employee.loc[employee['eid']==101, 'salary']=np.nan
employee

   eid      name   salary gender   address  dno   BG
0  101  Rajshree      NaN      f      pune  1.0   A+
1  102  Shrikant  40000.0      m    gujrat  2.0   B+
2  103   Ashwini  45000.0      f     tekdi  1.0  AB+
3  104    Shweta  25000.0      f      pune  NaN  NaN
4  108    Sakshi  34000.0      f      arvi  3.0   O+
5  107   Nishant  43000.0      m   karanja  1.0  NaN
6  106      Neha  30000.0      f      pune  2.0   B-
7  105   Nandini  38000.0      f  baramati  1.0  AB-

In [127]:
employee

   eid      name   salary gender   address  dno   BG
0  101  Rajshree      NaN      f      pune  1.0   A+
1  102  Shrikant  40000.0      m    gujrat  2.0   B+
2  103   Ashwini  45000.0      f     tekdi  1.0  AB+
3  104    Shweta  25000.0      f      pune  NaN  NaN
4  108    Sakshi  34000.0      f      arvi  3.0   O+
5  107   Nishant  43000.0      m   karanja  1.0  NaN
6  106      Neha  30000.0      f      pune  2.0   B-
7  105   Nandini  38000.0      f  baramati  1.0  AB-

## Handling Missing Values

In [128]:
employee

   eid      name   salary gender   address  dno   BG
0  101  Rajshree      NaN      f      pune  1.0   A+
1  102  Shrikant  40000.0      m    gujrat  2.0   B+
2  103   Ashwini  45000.0      f     tekdi  1.0  AB+
3  104    Shweta  25000.0      f      pune  NaN  NaN
4  108    Sakshi  34000.0      f      arvi  3.0   O+
5  107   Nishant  43000.0      m   karanja  1.0  NaN
6  106      Neha  30000.0      f      pune  2.0   B-
7  105   Nandini  38000.0      f  baramati  1.0  AB-

In [131]:
employee.isna()
# -> isna detect NaN values in true and false format

     eid   name  salary  gender  address    dno     BG
0  False  False    True   False    False  False  False
1  False  False   False   False    False  False  False
2  False  False   False   False    False  False  False
3  False  False   False   False    False   True   True
4  False  False   False   False    False  False  False
5  False  False   False   False    False  False   True
6  False  False   False   False    False  False  False
7  False  False   False   False    False  False  False

In [137]:
employee.isna().sum() 
# -> That's why we have to srite sum() after isna.

eid        0
name       0
salary     1
gender     0
address    0
dno        1
BG         2
dtype: int64

In [139]:
employee.drop('BG',axis=1) # It will  drop the column BG

   eid      name   salary gender   address  dno
0  101  Rajshree      NaN      f      pune  1.0
1  102  Shrikant  40000.0      m    gujrat  2.0
2  103   Ashwini  45000.0      f     tekdi  1.0
3  104    Shweta  25000.0      f      pune  NaN
4  108    Sakshi  34000.0      f      arvi  3.0
5  107   Nishant  43000.0      m   karanja  1.0
6  106      Neha  30000.0      f      pune  2.0
7  105   Nandini  38000.0      f  baramati  1.0

In [141]:
employee.dropna() ## Delete rows with null values.

   eid      name   salary gender   address  dno   BG
1  102  Shrikant  40000.0      m    gujrat  2.0   B+
2  103   Ashwini  45000.0      f     tekdi  1.0  AB+
4  108    Sakshi  34000.0      f      arvi  3.0   O+
6  106      Neha  30000.0      f      pune  2.0   B-
7  105   Nandini  38000.0      f  baramati  1.0  AB-

In [142]:
employee.isna().sum()

eid        0
name       0
salary     1
gender     0
address    0
dno        1
BG         2
dtype: int64

In [143]:
avg = employee['salary'].mean()

In [148]:
# employee.loc[employee['salary'].isna(),'salary']=avg

In [151]:
employee['salary'].fillna(avg,inplace=True) ## It gives error but not worry.

C:\Users\91814\AppData\Local\Temp\ipykernel_16452\3612432391.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  employee['salary'].fillna(avg,inplace=True) ## It gives error but not worry.

In [152]:
employee

   eid      name        salary gender   address  dno   BG
0  101  Rajshree  36428.571429      f      pune  1.0   A+
1  102  Shrikant  40000.000000      m    gujrat  2.0   B+
2  103   Ashwini  45000.000000      f     tekdi  1.0  AB+
3  104    Shweta  25000.000000      f      pune  NaN  NaN
4  108    Sakshi  34000.000000      f      arvi  3.0   O+
5  107   Nishant  43000.000000      m   karanja  1.0  NaN
6  106      Neha  30000.000000      f      pune  2.0   B-
7  105   Nandini  38000.000000      f  baramati  1.0  AB-